#str(строка) ""
#int(целые числа) 56
#float(числа с запятой) 5,1
#bool(булевый тип данных) True,False
#list(список) []
#tuple(кортеж) ()
#+
#словарь
#множество

#словари

# dict1 = {"ключ": 1,
#          "ключ2": "антон",
#          "якрут": True,
#          "словарь": {"лвл1": 1}} #пример создания словаря
# empty_dict1 = { } #1-й способ создания словаря
# empty_dict2 = dict() #2-й способ создания словаря
#
# print(dict1["словарь"] ["лвл1"])
#__________________________________________________________
#циклы:
#while и for
# x = 5
# while True: #бесконечный цикл
#     print(123)
# while False: #это ШИЗОФРЕНИЯ
#     print("я антон")
#__________________________________________________________
#for
# phrase = "фраза"
# for toyota_supra in phrase: #1-й способ: перебор в переменной
#     print(toyota_supra)

# for uber in range(5):
#     print(uber)
#__________________________________________________________
#множества

# empty_dict = dict() #способ создания пустого множества
# set1 = {1, 2, 3} #литеральный способ
# print(type(set1))
#__________________________________________________________

# set0 = {1, 1, 1, 2} #повторения исключены
# print(set0)
# set00 = {"а", "б", "в",} #неупорядоченый тип данных
# print(set00)
# set000 = {1, [2, 3]} #список во множестве
# #Typeerror -> нельзя изменяемые во множестве
#__________________________________________________________

#немутабельные типы данных = неизменяемые
#int, float, bool, str, tuple
#__________________________________________________________

#операции на множество

# set1 = {1, 2, 3, 4, 5}
# set2 = {3, 4, 5, 6, 7}
#
# #обьединение
# print(set1.union(set2))
# print(set1 | set2) #тоже самое
#
# #перечесление
# print(set1.intersection((set2)))
# print(set1 & set2)
#
# #разность
# print(set1.difference(set2))
# print(set1 - set2)
#
# #симитрическая разность
# print(set1.symmetric_difference(set2))
# print(set1 ^ set2)
#__________________________________________________________

# from random import randint
#
# lst = []
# for _ in range(5):
#     lst.append(randint(1, 5))
# print(lst)
#
# unique = set(lst) #список множество
# print(f"{len(unique)}шт."
#       f".:{unique}")

from random import randint

r_start = 0
r_end = 10_000
size = randint(100, 1000)
















